open-banking/src/test/resources/stubs/tsbgroup/pis/ob_3.1.1/payment-rejection/domestic-payment-consents.json

{
  "request": {
    "method": "POST",
    "url": "/apis/open-banking/v3.1/pisp/domestic-payment-consents",
    "headers": {
      "Authorization": {
        "equalTo": "Bearer SOME_RANDOM_ACCESS_TOKEN"
      },
      "x-fapi-financial-id": {
        "equalTo": "003882287203T83JKK"
      },
      "x-fapi-interaction-id": {
        "equalTo": "87da2798-f7e2-4823-80c1-3c03344b8f13"
      },
      "Accept": {
        "matches": "^application/json(, application/\\*\\+json)?$"
      }
    },
    "bodyPatterns": [
      {
        "equalToJson": {
          "Data": {
            "Initiation": {
              "InstructionIdentification": "${json-unit.any-string}",
              "EndToEndIdentification": "35B64F93",
              "InstructedAmount": {
                "Amount": "0.01",
                "Currency": "GBP"
              },
              "CreditorAccount": {
                "SchemeName": "UK.OBIE.SortCodeAccountNumber",
                "Identification": "12345678901234",
                "Name": "P. Jantje"
              },
              "RemittanceInformation": {
                "Unstructured": "SomeRandomMessage",
                "Reference": "SomeRandomMessage2"
              }
            }
          },
          "Risk": {
            "PaymentContextCode": "PartyToParty"
          }
        }
      }
    ]
  },
  "response": {
    "status": 201,
    "headers": {
      "Content-Type": "application/json"
    },
    "jsonBody": {
      "Data": {
        "Status": "Rejected"
      }
    }
  }
}